test/dummy_app/app/controllers/spreadsheets_controller.rb

SELECT "posts".* FROM "posts"
---
  def alt_xlsx
    @posts = Post.all